Repository: yangmt0409/StudySync
Catalog: StudySync/Localizable.xcstrings
Source language: zh_hans
Languages: en, ja, ko, zh_hant

source: 总天数
en: Total Days
ja: 合計日数
ko: 총 일수
zh_hant: 總天數

source: 恢复
en: Reset
ja: リセット
ko: 초기화
zh_hant: 恢復

source: 恢复失败: %@
en: Restore failed: %@
ja: 復元失敗: %@
ko: 복원 실패: %@
zh_hant: 恢復失敗：%@

source: 恢复购买
en: Restore Purchase
ja: 購入を復元
ko: 구매 복원
zh_hant: 恢復購買

source: 恢复默认布局
en: Reset to Default Layout
ja: デフォルトレイアウトに戻す
ko: 기본 레이아웃으로 초기화
zh_hant: 恢復預設佈局

source: 恭喜！你获得了 3 个月 Pro 奖励！
en: Congrats! You earned 3 months of Pro!
ja: おめでとうございます!3ヶ月のPro特典を獲得しました!
ko: 축하해요! 3개월 Pro 보상을 받았어요!
zh_hant: 恭喜！你獲得了 3 個月 Pro 獎勵！

source: 想要添加你为好友
en: wants to add you as a friend
ja: さんがあなたを友達に追加したがっています
ko: 님이 친구로 추가하고 싶어해요
zh_hant: 想要新增你為好友

source: 感染周围事件
en: Infect Nearby Events
ja: 周囲のイベントに波及
ko: 주변 이벤트 감염
zh_hant: 感染周圍事件

source: 感谢每一位为 StudySync 做出贡献的人
en: Thanks to everyone who contributed to StudySync
ja: StudySyncに貢献してくださった皆様に感謝します
ko: StudySync에 기여해주신 모든 분께 감사드려요
zh_hant: 感謝每一位為 StudySync 做出貢獻的人

source: 成功加入项目
en: Successfully joined project
ja: プロジェクトに参加しました
ko: 프로젝트에 참여했어요
zh_hant: 成功加入項目

source: 成员
en: Members
ja: メンバー
ko: 멤버
zh_hant: 成員

source: 成员们的空闲时间没有重叠，试试协调各自的时间轴
en: Members' free times don't overlap. Try coordinating your timelines
ja: メンバーの空き時間が重なっていません。それぞれのタイムラインを調整してみてください
ko: 멤버들의 자유 시간이 겹치지 않아요. 각자의 타임라인을 조정해보세요
zh_hant: 成員們的空閒時間沒有重疊，試試協調各自的時間軸

source: 成员位置
en: Member Locations
ja: メンバーの位置
ko: 멤버 위치
zh_hant: 成員位置

source: 成员到达时间
en: Member ETAs
ja: メンバーの到着時刻
ko: 멤버 도착 시간
zh_hant: 成員到達時間

source: 成员需要在社交页面开启「分享时间轴」
en: Members need to enable "Share Timeline" in the Social tab
ja: メンバーはソーシャルタブで「タイムラインを共有」を有効にする必要があります
ko: 멤버가 소셜 탭에서 '타임라인 공유'를 켜야 해요
zh_hant: 成員需要在社交頁面開啟「分享時間軸」

source: 成绩数据
en: Grades
ja: 成績
ko: 성적
zh_hant: 成績數據

source: 成绩组成
en: Grade Components
ja: 成績構成
ko: 성적 구성
zh_hant: 成績組成

source: 成绩计算
en: Grade Calculator
ja: 成績計算機
ko: 성적 계산기
zh_hant: 成績計算

source: 成长里程碑
en: Milestones
ja: マイルストーン
ko: 마일스톤
zh_hant: 成長里程碑

source: 我
en: Me
ja: 自分
ko: 나

source: 我们会在 deadline 前 1 / 3 / 7 天提醒你。你可以随时在设置里关闭。
en: We'll remind you 1 / 3 / 7 days before each deadline. You can turn this off anytime in Settings.
ja: 締切の1/3/7日前にお知らせします。設定でいつでもオフにできます。
ko: 마감 1/3/7일 전에 알려드려요. 설정에서 언제든 끌 수 있어요.
zh_hant: 我們會在 deadline 前 1 / 3 / 7 天提醒你。你可以隨時在設定裡關閉。

source: 我们只识别航班号 / 车次 / 机场 / 车站等关键字。
en: We detect keywords like flight numbers, train numbers, airports, and stations.
ja: 航空便名・列車名・空港・駅などのキーワードを検出します。
ko: 항공편 / 열차 / 공항 / 역 같은 키워드를 감지해요.
zh_hant: 我們只識別航班號 / 車次 / 機場 / 車站等關鍵字。

source: 我们已经给你准备了几个示例事件，你可以随时删除它们或添加自己的。
en: We've set up a few sample events for you. Feel free to delete them or add your own anytime.
ja: サンプルイベントをいくつか用意しました。いつでも削除したり、自分のイベントを追加できます。
ko: 샘플 이벤트 몇 개를 준비해 두었어요. 언제든 삭제하거나 직접 추가할 수 있어요.
zh_hant: 我們已經給你準備了幾個範例事件,你可以隨時刪除它們或新增自己的。

source: 我的
en: Mine
ja: マイ
ko: 내 것

source: 我的书桌
en: My Desk
ja: マイデスク
ko: 내 책상
zh_hant: 我的書桌

source: 我的到达时间
en: My ETA
ja: マイETA
ko: 내 도착 시간
zh_hant: 我的到達時間

source: 我的好友码
en: My Friend Code
ja: マイフレンドコード
ko: 내 친구 코드
zh_hant: 我的好友碼

source: 我的时间轴
en: My Timeline
ja: マイタイムライン
ko: 내 타임라인
zh_hant: 我的時間軸

source: 我知道了
en: Got It
ja: わかりました
ko: 확인

source: 或使用邮箱
en: or use email
ja: またはメールを使用
ko: 또는 이메일 사용
zh_hant: 或使用郵箱

source: 截止日期
en: Due Date
ja: 締切日
ko: 마감일

source: 截止日期效果
en: Deadline Effects
ja: 締切エフェクト
ko: 마감일 효과

source: 房主
en: Host
ja: ホスト
ko: 호스트

source: 所属日历
en: Calendar
ja: カレンダー
ko: 캘린더
zh_hant: 所屬日曆

source: 所有开启分享的成员都有空的时间
en: Times when all sharing members are available
ja: 共有を有効にした全メンバーが空いている時間
ko: 공유를 켠 모든 멤버가 비어있는 시간
zh_hant: 所有開啟分享的成員都有空的時間

source: 所有成员将无法再通过此链接加入
en: All members will no longer be able to join via this link
ja: すべてのメンバーがこのリンクから参加できなくなります
ko: 모든 멤버가 이 링크로 참여할 수 없게 돼요
zh_hant: 所有成員將無法再通過此連結加入

source: 所有里程碑已达成
en: All milestones achieved
ja: すべてのマイルストーン達成
ko: 모든 마일스톤 달성
zh_hant: 所有里程碑已達成

source: 手动输入
en: Manual Entry
ja: 手動入力
ko: 수동 입력
zh_hant: 手動輸入

source: 打卡
en: Check In
ja: チェックイン
ko: 체크인

source: 打卡成功！继续保持 💪
en: Checked in! Keep it up 💪
ja: チェックイン完了!この調子で 💪
ko: 체크인 완료! 계속 유지하세요 💪
zh_hant: 打卡成功！繼續保持 💪

source: 打卡记录
en: Check-in History
ja: チェックイン履歴
ko: 체크인 기록
zh_hant: 打卡記錄

source: 打卡频率
en: Check-in Frequency
ja: チェックイン頻度
ko: 체크인 빈도
zh_hant: 打卡頻率

source: 打开 Apple Wallet
en: Open Apple Wallet
ja: Apple Wallet を開く
ko: Apple Wallet 열기
zh_hant: 開啟 Apple Wallet

source: 打开设置
en: Open Settings
ja: 設定を開く
ko: 설정 열기
zh_hant: 開啟設定

source: 扫描二维码
en: Scan QR Code
ja: QRコードをスキャン
ko: QR 코드 스캔
zh_hant: 掃描二維碼

source: 扫描日历中…
en: Scanning calendar…
ja: カレンダーをスキャン中…
ko: 캘린더 스캔 중…
zh_hant: 掃描日曆中…

source: 扫描条码
en: Scan Barcode
ja: バーコードスキャン
ko: 바코드 스캔
zh_hant: 掃描條碼

source: 扫描登机牌 / 车票条码
en: Scan boarding pass / ticket barcode
ja: 搭乗券 / チケットバーコードをスキャン
ko: 탑승권 / 티켓 바코드 스캔
zh_hant: 掃描登機牌 / 車票條碼

source: 扫码加入
en: Scan to Join
ja: QRで参加
ko: QR로 참여
zh_hant: 掃碼加入

source: 找到 %lld 个可用时段
en: %lld available time slots found
ja: %lld個の空き時間帯が見つかりました
ko: 사용 가능한 시간대 %lld개 발견
zh_hant: 找到 %lld 個可用時段

source: 把待办、倒计时、专注记录等数据同步到你的所有 Apple 设备。
en: Sync your todos, countdowns, focus sessions, and more across all your Apple devices.
ja: ToDo、カウントダウン、集中セッションなどのデータを、お使いのすべての Apple デバイスで同期します。
ko: 할 일, 카운트다운, 집중 세션 등의 데이터를 모든 Apple 기기에서 동기화합니다.
zh_hant: 把待辦、倒數、專注紀錄等資料同步到你的所有 Apple 裝置。

source: 投票取消
en: Vote to Cancel
ja: キャンセル投票
ko: 취소 투표

source: 拍一拍
en: Nudge
ja: ノッジ
ko: 찌르기

source: 拍一拍 TA
en: Nudge
ja: ノッジ
ko: 찌르기

source: 拒绝
en: Decline
ja: 拒否
ko: 거절
zh_hant: 拒絕

source: 拒绝后该请求将被移除
en: This request will be removed after rejection.
ja: 拒否すると、このリクエストは削除されます。
ko: 거절하면 이 요청이 제거돼요.
zh_hant: 拒絕後該請求將被移除

source: 拖动排序，点击 − 移入「更多」。至少保留 2 个标签。
en: Drag to reorder, tap − to move to "More". Keep at least 2 tabs.
ja: ドラッグで並び替え、−をタップで「その他」へ移動。最低2つのタブを残します。
ko: 드래그해서 순서 변경, − 탭으로 '더보기'로 이동. 최소 2개 탭 유지.
zh_hant: 拖動排序，點擊 − 移入「更多」。至少保留 2 個標籤。

source: 拖动调整标签顺序。排在前面的标签显示在导航栏，其余在「更多」中。
en: Drag to reorder. Top tabs appear in the navigation bar, the rest in "More".
ja: ドラッグでタブの順序を調整。上位のタブはナビゲーションバーに、その他は「その他」に表示されます。
ko: 드래그로 탭 순서 조정. 상위 탭은 내비게이션 바에, 나머지는 '더보기'에 표시돼요.
zh_hant: 拖動調整標籤順序。排在前面的標籤顯示在導航列，其餘在「更多」中。

source: 拥有 5 个好友
en: Have 5 friends
ja: 友達を5人持つ
ko: 친구 5명 보유
zh_hant: 擁有 5 個好友

source: 按模型
en: By Model
ja: モデル別
ko: 모델별

source: 接受
en: Accept
ja: 承認
ko: 수락

source: 控制日程 Tab 中显示的事件范围和类型
en: Control the range and types of events shown in the Schedule tab
ja: スケジュールタブに表示するイベントの範囲と種類を管理
ko: 일정 탭에 표시되는 이벤트 범위와 유형 제어
zh_hant: 控制日程分頁中顯示的事件範圍和類型

source: 提前 1 小时
en: 1 hour before
ja: 1時間前
ko: 1시간 전
zh_hant: 提前 1 小時

source: 提前 15 分钟
en: 15 minutes before
ja: 15分前
ko: 15분 전
zh_hant: 提前 15 分鐘

source: 提前 30 分钟
en: 30 minutes before
ja: 30分前
ko: 30분 전
zh_hant: 提前 30 分鐘

source: 提前提醒
en: Remind
ja: リマインダー
ko: 알림

source: 提升 %@%% 较上周
en: %@%% up from last week
ja: 先週比 %@%% アップ
ko: 지난주 대비 %@%% 증가
zh_hant: 提升 %@%% 較上週

source: 提示：如果分享面板里没有 StudySync，先把 Pass 用「存储到文件」保存到 iCloud Drive，再到「文件」app 里点开 → 选 StudySync 打开。
en: Tip: If StudySync isn't in the share sheet, first save the Pass to iCloud Drive via "Save to Files", then open the .pkpass file from the Files app and choose StudySync.
ja: ヒント：共有シートに StudySync が表示されない場合は、まず「ファイルに保存」で Pass を iCloud Drive に保存し、その後ファイル App から開いて StudySync を選んでください。
ko: 팁: 공유 시트에 StudySync가 없으면, 먼저 "파일에 저장"으로 Pass를 iCloud Drive에 저장한 다음 "파일" 앱에서 열어 StudySync를 선택하세요.
zh_hant: 提示：如果分享面板裡沒有 StudySync,先用「儲存到檔案」把 Pass 存到 iCloud Drive,再到「檔案」App 裡點開 → 選 StudySync 開啟。

source: 提醒
en: Reminder
ja: リマインダー
ko: 알림

source: 提醒方案
en: Reminder preset
ja: リマインダープリセット
ko: 알림 설정

source: 提醒设置
en: Alert Settings
ja: 通知設定
ko: 알림 설정
zh_hant: 提醒設定

source: 搜索
en: Search
ja: 検索
ko: 검색
zh_hant: 搜尋

source: 搜索事件...
en: Search events...
ja: イベントを検索...
ko: 이벤트 검색...
zh_hant: 搜尋事件...

source: 搜索地点...
en: Search locations...
ja: 場所を検索...
ko: 위치 검색...
zh_hant: 搜尋地點...

source: 搜索城市...
en: Search cities...
ja: 都市を検索...
ko: 도시 검색...
zh_hant: 搜尋城市...

source: 搜索超时，请重试
en: Search timed out, please try again
ja: 検索がタイムアウトしました。再試行してください
ko: 검색 시간 초과, 다시 시도해주세요
zh_hant: 搜尋逾時，請重試

source: 搜索车站
en: Search stations
ja: 駅を検索
ko: 역 검색
zh_hant: 搜尋車站

source: 撤销
en: Undo
ja: 取り消す
ko: 실행 취소
zh_hant: 撤銷

source: 撤销今日打卡
en: Undo today's check-in
ja: 今日のチェックインを取り消す
ko: 오늘 체크인 취소
zh_hant: 撤銷今日打卡

source: 播放庆祝动画
en: Play Celebration
ja: お祝いアニメーションを再生
ko: 축하 애니메이션 재생
zh_hant: 播放慶祝動畫

source: 操作失败，请检查网络连接
en: Operation failed. Please check your network connection.
ja: 操作に失敗しました。ネットワーク接続を確認してください
ko: 작업 실패, 네트워크 연결을 확인해주세요

source: 操作成功
en: Success
ja: 成功
ko: 성공

source: 支持大多数航空公司 / 12306 的 PDF 电子客票。
en: Supports most airlines and 12306 PDF e-tickets.
ja: ほとんどの航空会社や12306のPDF電子チケットに対応しています。
ko: 대부분의 항공사와 12306 PDF 전자티켓을 지원해요.
zh_hant: 支援大多數航空公司 / 12306 的 PDF 電子票。

source: 支持携程 / 12306 / 邮件行程提醒等，自动识别航班号 / 车次。
en: Supports Ctrip, 12306, and email itineraries. Auto-detects flight/train numbers.
ja: Ctrip、12306、メール行程などに対応、航空便名・列車番号を自動検出します。
ko: 씨트립, 12306, 이메일 일정 등을 지원하며 항공편 / 열차 번호를 자동 감지해요.
zh_hant: 支援攜程 / 12306 / 郵件行程提醒等，自動識別航班號 / 車次。

source: 放弃
en: Give Up
ja: 中止
ko: 포기
zh_hant: 放棄

source: 放弃更改
en: Discard Changes
ja: 変更を破棄
ko: 변경사항 취소
zh_hant: 放棄更改

source: 放弃本次专注？
en: Give up this session?
ja: このセッションを中止しますか?
ko: 이번 집중을 포기할까요?
zh_hant: 放棄本次專注？

source: 数据可能已过期
en: Data may be outdated
ja: データが古い可能性があります
ko: 데이터가 오래됐을 수 있어요
zh_hant: 數據可能已過期

source: 数据存在你的 iCloud 私人空间，他人无法访问
en: Stored in your private iCloud space — only you can access it
ja: あなたの iCloud プライベート領域に保存され、他人はアクセスできません
ko: 본인의 iCloud 개인 공간에 저장되며 다른 사람은 접근할 수 없습니다
zh_hant: 資料儲存在你的 iCloud 私人空間，他人無法存取

source: 数据导出
en: Data Export
ja: データエクスポート
ko: 데이터 내보내기
zh_hant: 數據匯出

source: 数据来源
en: Source
ja: ソース
ko: 출처
zh_hant: 資料來源

source: 数据来源 AeroDataBox (RapidAPI) · 免费 500 次/月 · 支持未来/历史日期
en: Source: AeroDataBox (RapidAPI) · 500 free queries/month · supports past & future dates
ja: ソース: AeroDataBox (RapidAPI) · 月500回まで無料 · 過去/未来の日付に対応
ko: 출처: AeroDataBox (RapidAPI) · 월 500회 무료 · 과거·미래 날짜 지원
zh_hant: 資料來源 AeroDataBox (RapidAPI) · 免費 500 次/月 · 支援未來/歷史日期

source: 数据来源 AviationStack · 免费 100 次/月 · 免费版仅支持当日实时
en: Source: AviationStack · 100 free queries/month · free tier supports same-day only
ja: ソース: AviationStack · 月100回まで無料 · 無料版は当日のみ対応
ko: 출처: AviationStack · 월 100회 무료 · 무료 등급은 당일만 지원
zh_hant: 資料來源 AviationStack · 免費 100 次/月 · 免費版僅支援當日即時

source: 数据来源 AviationStack · 免费套餐 100 次/月
en: Data from AviationStack · Free tier 100 req/month
ja: データ提供: AviationStack · 無料枠100回/月
ko: 데이터 제공: AviationStack · 무료 100회/월
zh_hant: 資料來源 AviationStack · 免費方案 100 次/月

source: 数据积累中，稍后查看趋势图
en: Collecting data, check back later for trends
ja: データ収集中。しばらくしてからトレンドグラフをご確認ください
ko: 데이터를 모으는 중, 나중에 추세 그래프를 확인하세요
zh_hant: 數據累積中，稍後查看趨勢圖

source: 文字颜色
en: Text Color
ja: テキストカラー
ko: 텍스트 색상
zh_hant: 文字顏色

source: 方形
en: Square
ja: 四角
ko: 정사각형

source: 旅行
en: Travel
ko: 여행

source: 无提醒
en: None
ja: なし
ko: 알림 없음
zh_hant: 無提醒

source: 无效的邀请二维码
en: Invalid invite QR code
ja: 無効な招待QRコード
ko: 유효하지 않은 초대 QR 코드
zh_hant: 無效的邀請二維碼

source: 无标题
en: Untitled
ja: 無題
ko: 제목 없음
zh_hant: 無標題

source: 无法加载产品信息
en: Unable to load product info
ja: 製品情報を読み込めません
ko: 제품 정보를 로드할 수 없어요
zh_hant: 無法載入產品資訊

source: 无法计算目标日期
en: Unable to calculate target date
ja: 目標日を計算できません
ko: 목표 날짜를 계산할 수 없어요
zh_hant: 無法計算目標日期

source: 无法识别
en: Not recognized
ja: 認識できません
ko: 인식할 수 없어요
zh_hant: 無法識別

source: 无法读取 PDF
en: Cannot read PDF
ja: PDFを読み込めません
ko: PDF를 읽을 수 없어요
zh_hant: 無法讀取 PDF

source: 无法读取 Wallet 文件：
en: Could not read Wallet file:
ja: Wallet ファイルを読み取れませんでした：
ko: Wallet 파일을 읽을 수 없습니다:
zh_hant: 無法讀取 Wallet 檔案：

source: 无法读取事件数据
en: Unable to read event data
ja: イベントデータを読み取れません
ko: 이벤트 데이터를 읽을 수 없어요
zh_hant: 無法讀取事件資料

source: 无限
en: Unlimited
ja: 無制限
ko: 무제한
zh_hant: 無限

source: 日历中没有检测到行程
en: No travel detected in your calendar
ja: カレンダーに行程が見つかりません
ko: 캘린더에서 행정을 찾지 못했어요
zh_hant: 日曆中沒有偵測到行程

source: 日历导入
en: Calendar Import
ja: カレンダー取り込み
ko: 캘린더 가져오기
zh_hant: 日曆匯入

source: 日历访问被拒绝
en: Calendar Access Denied
ja: カレンダーへのアクセスが拒否されました
ko: 캘린더 접근이 거부됐어요
zh_hant: 日曆存取被拒絕

source: 日期
en: Date
ja: 日付
ko: 날짜

source: 日程
en: Schedule
ja: スケジュール
ko: 일정

source: 日落橙
en: Sunset Orange
ja: サンセットオレンジ
ko: 선셋 오렌지

source: 早上好 👋
en: Good Morning 👋
ja: おはようございます 👋
ko: 좋은 아침이에요 👋
zh_hant: 早安 👋

source: 时差 %lld 小时
en: %lld hours difference
ja: %lld時間の時差
ko: 시차 %lld시간
zh_hant: 時差 %lld 小時

source: 时长
en: Duration
ja: 所要時間
ko: 소요 시간
zh_hant: 時長

source: 时间单位
en: Time Unit
ja: 時間単位
ko: 시간 단위
zh_hant: 時間單位

source: 时间轴
en: Timeline
ja: タイムライン
ko: 타임라인
zh_hant: 時間軸

source: 明天
en: Tomorrow
ja: 明日
ko: 내일

source: 明天再提醒
en: Remind Tomorrow
ja: 明日通知
ko: 내일 다시 알림

source: 星星
en: Star
ja: 星
ko: 별

source: 昨天
en: Yesterday
ja: 昨日
ko: 어제

source: 昵称
en: Display Name
ja: 表示名
ko: 표시 이름
zh_hant: 暱稱

source: 显示
en: Display
ja: 表示
ko: 표시
zh_hant: 顯示

source: 显示全天事件
en: Show All-Day Events
ja: 終日イベントを表示
ko: 종일 이벤트 표시
zh_hant: 顯示全天事件

source: 显示已结束事件
en: Show Ended Events
ja: 終了したイベントを表示
ko: 종료된 이벤트 표시
zh_hant: 顯示已結束事件

source: 显示已过期事件
en: Show Expired Events
ja: 期限切れイベントを表示
ko: 만료된 이벤트 표시
zh_hant: 顯示已過期事件

source: 显示模式
en: Display Mode
ja: 表示モード
ko: 표시 모드
zh_hant: 顯示模式

source: 显示百分比
en: Show Percentage
ja: パーセント表示
ko: 백분율 표시
zh_hant: 顯示百分比

source: 显示范围
en: Display Range
ja: 表示範囲
ko: 표시 범위
zh_hant: 顯示範圍

source: 显示设置
en: Display
ja: 表示
ko: 표시
zh_hant: 顯示設定

source: 晚上好 👋
en: Good Evening 👋
ja: こんばんは 👋
ko: 안녕하세요 👋
zh_hant: 晚安 👋

source: 普通列车提醒
en: Train reminders
ja: 在来線リマインダー
ko: 일반 열차 알림
zh_hant: 普通列車提醒

source: 暂不开启
en: Not now
ja: 後で
ko: 나중에
zh_hant: 暫不開啟

source: 暂停
en: Pause
ja: 一時停止
ko: 일시 중지
zh_hant: 暫停

source: 暂无 Codex 用量数据
en: No Codex usage data available
ja: Codex使用量データがありません
ko: Codex 사용량 데이터가 없어요
zh_hant: 暫無 Codex 用量資料

source: 暂无 Due 事件
en: No Due Events
ja: Dueイベントがありません
ko: Due 이벤트가 없어요
zh_hant: 暫無 Due 事件

source: 暂无事件
en: No events
ja: イベントがありません
ko: 이벤트가 없어요
zh_hant: 暫無事件

source: 暂无动态
en: No Activity
ja: アクティビティなし
ko: 활동 없음
zh_hant: 暫無動態

source: 暂无徽章
en: No badges yet
ja: まだバッジがありません
ko: 아직 배지가 없어요
zh_hant: 暫無徽章

source: 暂无成员共享位置
en: No members sharing location yet
ja: 位置情報を共有中のメンバーはいません
ko: 위치를 공유한 멤버가 없어요
zh_hant: 暫無成員共享位置

source: 暂无成员开启时间轴分享
en: No members have enabled timeline sharing
ja: タイムライン共有を有効にしているメンバーはいません
ko: 타임라인 공유를 켠 멤버가 없어요
zh_hant: 暫無成員開啟時間軸分享

source: 暂无成绩项目
en: No grade components yet
ja: 成績項目がまだありません
ko: 성적 항목이 없어요
zh_hant: 暫無成績項目

source: 暂无数据
en: No Data
ja: データなし
ko: 데이터 없음
zh_hant: 暫無數據

source: 暂无时间轴数据
en: No timeline data yet
ja: タイムラインデータがありません
ko: 타임라인 데이터가 없어요
zh_hant: 暫無時間軸資料

source: 暂无活跃房间
en: No Active Rooms
ja: アクティブなルームがありません
ko: 활성 룸이 없어요
zh_hant: 暫無活躍房間

source: 暂无项目邀请
en: No project invites
ja: プロジェクト招待がありません
ko: 프로젝트 초대가 없어요
zh_hant: 暫無項目邀請

source: 更多
en: More
ja: その他
ko: 더보기

source: 更多行程
en: More trips
ja: その他の旅程
ko: 추가 일정

source: 更换地点
en: Change Location
ja: 場所を変更
ko: 위치 변경
zh_hant: 更換地點

source: 更换或重装设备后一键恢复
en: One-tap restore after switching or reinstalling
ja: 機種変更や再インストール後にワンタップで復元
ko: 기기 변경이나 재설치 후 한 번에 복원
zh_hant: 更換或重裝裝置後一鍵還原

source: 更新于
en: Updated at
ja: 更新日時:
ko: 업데이트:
zh_hant: 更新於

source: 月
en: Month
ko: 월

source: 月度之星
en: Monthly Star
ja: マンスリースター
ko: 이달의 별

source: 有效分数
en: Effective Score
ja: 有効スコア
ko: 유효 점수
zh_hant: 有效分數

source: 有空
en: Free
ja: 空き
ko: 여유

source: 有逾期任务
en: Overdue tasks
ja: 期限超過タスクあり
ko: 기한 초과 태스크 있음
zh_hant: 有逾期任務

source: 朋友的时间轴
en: Friends' Timelines
ja: 友達のタイムライン
ko: 친구의 타임라인
zh_hant: 朋友的時間軸

source: 服务条款
en: Terms of Use
ja: 利用規約
ko: 이용약관
zh_hant: 服務條款

source: 期末需要
en: Final Needed
ja: 期末に必要なスコア
ko: 기말에 필요한 점수

source: 未保存的更改
en: Unsaved Changes
ja: 未保存の変更
ko: 저장되지 않은 변경사항
zh_hant: 未儲存的更改

source: 未分配
en: Unassigned
ja: 未割り当て
ko: 미배정

source: 未开启
en: Off
ja: オフ
ko: 꺼짐
zh_hant: 未開啟

source: 未录入
en: Not Entered
ja: 未入力
ko: 미입력
zh_hant: 未錄入

source: 未找到关联的组织。
en: No associated organization found.
ja: 関連する組織が見つかりませんでした。
ko: 연결된 조직을 찾을 수 없어요.
zh_hant: 未找到關聯的組織。

source: 未找到可恢复的购买记录
en: No restorable purchases found
ja: 復元可能な購入履歴が見つかりません
ko: 복원할 수 있는 구매 기록을 찾을 수 없어요
zh_hant: 未找到可恢復的購買記錄

source: 未找到该用户
en: User not found
ja: ユーザーが見つかりません
ko: 사용자를 찾을 수 없어요
zh_hant: 未找到該用戶

source: 未找到该航班，请检查航班号和日期
en: Flight not found — check the number and date
ja: 航空便が見つかりません、便名と日付を確認してください
ko: 항공편을 찾지 못했어요, 번호와 날짜를 확인하세요
zh_hant: 未找到該航班,請檢查航班號和日期

source: 未找到该项目
en: Project not found
ja: プロジェクトが見つかりません
ko: 프로젝트를 찾을 수 없어요
zh_hant: 未找到該項目

source: 未登录
en: Not signed in
ja: サインインしていません
ko: 로그인되지 않음
zh_hant: 未登入

source: 未能从文本中识别航班或车次信息
en: Couldn't detect any flight or train info in the text
ja: テキストから航空便/列車情報を検出できませんでした
ko: 텍스트에서 항공편 / 열차 정보를 감지하지 못했어요
zh_hant: 未能從文字中識別航班或車次資訊

source: 未配置 %@ API 密钥 — 请先填入
en: %@ API key not configured — please add it first
ja: %@ APIキーが未設定です — 先に入力してください
ko: %@ API 키가 설정되지 않았습니다 — 먼저 입력해 주세요
zh_hant: 未設定 %@ API 密鑰 — 請先填入

source: 未配置 AviationStack API 密钥 — 请到设置里填入
en: AviationStack API key not configured — add it in Settings
ja: AviationStack APIキーが未設定です — 設定で入力してください
ko: AviationStack API 키가 설정되지 않았어요 — 설정에서 입력하세요
zh_hant: 未設定 AviationStack API 金鑰 — 請到設定裡填入

source: 本周
en: This Week
ja: 今週
ko: 이번 주
zh_hant: 本週

source: 本周学习 %lld 分钟
en: Studied %lld min this week
ja: 今週%lld分学習
ko: 이번 주 %lld분 학습
zh_hant: 本週學習 %lld 分鐘

source: 本周学习 %lld 小时 %lld 分钟
en: Studied %1$lld h %2$lld min this week
ja: 今週%1$lld時間%2$lld分学習
ko: 이번 주 %1$lld시간 %2$lld분 학습
zh_hant: 本週學習 %1$lld 小時 %2$lld 分鐘

source: 本周报告
en: Weekly Report
ja: 週間レポート
ko: 주간 리포트
zh_hant: 本週報告

source: 本周暂无专注记录
en: No focus sessions this week
ja: 今週のフォーカスセッションはまだありません
ko: 이번 주 집중 기록이 없어요
zh_hant: 本週暫無專注紀錄

source: 本周暂无共同空闲时间
en: No common free time this week
ja: 今週は共通の空き時間がありません
ko: 이번 주 공통 자유 시간이 없어요
zh_hant: 本週暫無共同空閒時間

source: 本月共享 %@ 配额已用完 — 请配置您自己的 API Key（免费）继续使用
en: Shared %@ quota for this month is exhausted — configure your own free API key to continue
ja: 今月の共有%@クォータを使い切りました — ご自身の無料APIキーを設定してください
ko: 이번 달 공유 %@ 할당량이 모두 소진되었습니다 — 본인의 무료 API 키를 설정해 주세요
zh_hant: 本月共用 %@ 配額已用完 — 請設定您自己的免費 API Key 繼續使用

source: 本月挑战已完成
en: Challenge completed!
ja: 今月のチャレンジ完了!
ko: 이번 달 챌린지 완료!
zh_hant: 本月挑戰已完成

source: 本月累计专注满 30 小时可免费获得 3 个月 Pro
en: Focus 30h this month to earn 3 months of Pro for free
ja: 今月のフォーカス累計30時間達成で3ヶ月Pro無料
ko: 이번 달 누적 집중 30시간 달성 시 3개월 Pro 무료 제공
zh_hant: 本月累計專注滿 30 小時可免費獲得 3 個月 Pro

source: 机场 / 车站
en: Airport / Station
ja: 空港 / 駅
ko: 공항 / 역
zh_hant: 機場 / 車站

source: 权重
en: Weight
ja: 重み
ko: 가중치
zh_hant: 權重

source: 权重之和必须为 100%
en: Weights must add up to 100%
ja: 重みの合計は100%である必要があります
ko: 가중치 합계가 100%여야 해요
zh_hant: 權重之和必須為 100%

source: 权重合计 %lld%%
en: Total Weight %lld%%
ja: 合計の重み %lld%%
ko: 가중치 합계 %lld%%
zh_hant: 權重合計 %lld%%

source: 权重合计不等于 100%，成绩计算可能不准确
en: Weights do not add up to 100%. Grade calculation may be inaccurate.
ja: 重みの合計が100%でないため、成績計算が不正確になる可能性があります
ko: 가중치 합계가 100%가 아니라서 성적 계산이 부정확할 수 있어요
zh_hant: 權重合計不等於 100%，成績計算可能不準確

source: 来源：
en: Source:
ja: 取得元:
ko: 출처:
zh_hant: 來源：

source: 极简
en: Minimal
ja: ミニマル
ko: 미니멀
zh_hant: 極簡

source: 极简风
en: Minimal
ja: ミニマル
ko: 미니멀
zh_hant: 極簡風

source: 构建号
en: Build
ja: ビルド
ko: 빌드
zh_hant: 建構號

source: 查找会议时间
en: Find Meeting Time
ja: ミーティング時間を探す
ko: 미팅 시간 찾기
zh_hant: 查找會議時間

source: 查看
en: View
ja: 表示
ko: 보기

source: 查看 %@ 的倒计时
en: Check %@ countdown
ja: %@のカウントダウンを確認
ko: %@ 카운트다운 확인
zh_hant: 查看 %@ 的倒數

source: 查看 ${eventName} 的倒计时
en: Check countdown for ${eventName}
ja: ${eventName}のカウントダウンを確認
ko: ${eventName} 카운트다운 확인
zh_hant: 查看 ${eventName} 的倒數

source: 查看 Due
en: View Dues
ja: Dueを表示
ko: Due 보기

source: 查看 Due 进度
en: View Due Progress
ja: Due進捗を表示
ko: Due 진행상황 보기
zh_hant: 查看 Due 進度

source: 查看倒计时
en: Check Countdown
ja: カウントダウンを確認
ko: 카운트다운 보기
zh_hant: 查看倒數

source: 查看最近的倒计时事件概览
en: View recent countdown overview
ja: 最近のカウントダウン概要を表示
ko: 최근 카운트다운 개요 보기
zh_hant: 查看最近的倒數事件概覽

source: 查看时间轴
en: View Timeline
ja: タイムラインを表示
ko: 타임라인 보기
zh_hant: 查看時間軸

source: 查看用量页面
en: View Usage Page
ja: 使用量ページを表示
ko: 사용량 페이지 보기
zh_hant: 查看用量頁面

source: 查看详情
en: View Details
ja: 詳細を表示
ko: 자세히 보기
zh_hant: 查看詳情

source: 查询
en: Search
ja: 検索
ko: 조회
zh_hant: 查詢

source: 查询某个倒计时事件的剩余天数
en: Query remaining days for a countdown event
ja: カウントダウンイベントの残り日数を照会
ko: 카운트다운 이벤트의 남은 일수 조회
zh_hant: 查詢某個倒數事件的剩餘天數

source: 查询结果
en: Results
ja: 結果
ko: 결과
zh_hant: 查詢結果

source: 查询车次 / 手动输入
en: Train lookup / manual entry
ja: 列車検索 / 手動入力
ko: 열차 조회 / 수동 입력
zh_hant: 查詢車次 / 手動輸入

source: 标签栏
en: Tab Bar
ja: タブバー
ko: 탭바
zh_hant: 標籤列

source: 标签栏自定义
en: Tab Bar Customization
ja: タブバーのカスタマイズ
ko: 탭바 커스터마이징
zh_hant: 標籤列自訂

source: 标记为 Due
en: Mark as Due
ja: Dueとしてマーク
ko: Due로 표시
zh_hant: 標記為 Due

source: 标记为考试
en: Mark as Exam
ja: 試験としてマーク
ko: 시험으로 표시
zh_hant: 標記為考試

source: 标记完成
en: Mark Complete
ja: 完了としてマーク
ko: 완료로 표시
zh_hant: 標記完成

source: 标记未完成
en: Mark Incomplete
ja: 未完了としてマーク
ko: 미완료로 표시
zh_hant: 標記未完成

source: 标题
en: Title
ja: タイトル
ko: 제목
zh_hant: 標題

source: 森林绿
en: Forest Green
ja: フォレストグリーン
ko: 포레스트 그린
zh_hant: 森林綠

source: 模板
en: Template
ja: テンプレート
ko: 템플릿

source: 次数
en: Sessions
ja: 回数
ko: 횟수
zh_hant: 次數

source: 欢迎来到 StudySync
en: Welcome to StudySync
ja: StudySyncへようこそ
ko: StudySync에 오신 것을 환영해요
zh_hant: 歡迎來到 StudySync

source: 正在删除账户…
en: Deleting account…
ja: アカウントを削除中…
ko: 계정을 삭제 중…
zh_hant: 正在刪除帳戶…

source: 正在计算共同空闲时间…
en: Calculating common free times…
ja: 共通の空き時間を計算中…
ko: 공통 자유 시간을 계산 중…
zh_hant: 正在計算共同空閒時間…

source: 正在连接...
en: Connecting...
ja: 接続中...
ko: 연결 중...
zh_hant: 正在連接...

source: 正常
en: Normal
ja: 通常
ko: 정상

source: 正计时模式
en: Count Up Mode
ja: カウントアップモード
ko: 카운트업 모드
zh_hant: 正計時模式

source: 正计时模式下，显示从开始日期到现在已经过去的时间
en: In count-up mode, shows elapsed time from the start date to now
ja: カウントアップモードでは、開始日から現在までの経過時間を表示します
ko: 카운트업 모드에서는 시작일부터 현재까지 경과한 시간을 표시해요
zh_hant: 正計時模式下，顯示從開始日期到現在已經過去的時間

source: 此操作不可撤销。你的账户、好友关系、分享的 Due、时间轴、组队专注、学习目标云端记录将被永久删除。本地的倒计时和学习目标仍保留在设备上。
en: This action cannot be undone. Your account, friendships, shared dues, timeline, group focus rooms, and cloud study goal records will be permanently removed. Countdowns and study goals stored on this device will remain.
ja: この操作は取り消せません。アカウント、友達関係、共有したDue、タイムライン、グループフォーカス、学習目標のクラウド記録は完全に削除されます。デバイスに保存されたカウントダウンと学習目標は残ります。
ko: 이 작업은 되돌릴 수 없어요. 계정, 친구 관계, 공유한 Due, 타임라인, 그룹 집중방, 학습 목표의 클라우드 기록이 영구 삭제돼요. 기기에 저장된 카운트다운과 학습 목표는 유지돼요.
zh_hant: 此操作無法撤銷。你的帳戶、好友關係、分享的 Due、時間軸、組隊專注、學習目標雲端紀錄將被永久刪除。本地的倒數和學習目標仍保留在裝置上。

source: 步行
en: Walk
ja: 徒歩
ko: 도보

source: 段数
en: Segments
ja: 区間
ko: 구간
zh_hant: 段數

source: 每两周
en: Biweekly
ja: 隔週
ko: 격주
zh_hant: 每兩週

source: 每个点代表
en: Each dot represents
ja: 各ドットは
ko: 각 점은
zh_hant: 每個點代表

source: 每周
en: Weekly
ja: 毎週
ko: 매주
zh_hant: 每週

source: 每周打卡
en: Weekly
ja: 毎週
ko: 매주
zh_hant: 每週打卡

source: 每周打卡一次，适合长周期目标
en: Check in once a week for long-term goals
ja: 週1回のチェックインで長期目標に最適
ko: 주 1회 체크인, 장기 목표에 적합
zh_hant: 每週打卡一次，適合長週期目標

source: 每周用量
en: Weekly Usage
ja: 週間使用量
ko: 주간 사용량
zh_hant: 每週用量

source: 每周额度
en: Weekly Quota
ja: 週間クォータ
ko: 주간 한도
zh_hant: 每週額度

source: 每天
en: Daily
ja: 毎日
ko: 매일

source: 每天打卡一次，坚持每日习惯
en: Check in once a day to build daily habits
ja: 毎日チェックインして習慣を作りましょう
ko: 매일 체크인해서 일상 습관 만들기
zh_hant: 每天打卡一次，堅持每日習慣

source: 每年
en: Yearly
ja: 毎年
ko: 매년

source: 每日专注
en: Daily Focus
ja: デイリーフォーカス
ko: 일일 집중
zh_hant: 每日專注

source: 每日打卡
en: Daily
ja: 毎日
ko: 매일

source: 每日用量
en: Daily Usage
ja: 日次使用量
ko: 일일 사용량

source: 每日目标、连续打卡、里程碑庆祝，养成长期习惯。
en: Daily goals, streaks, and milestone celebrations to build lasting habits.
ja: 日々の目標、連続チェックイン、マイルストーン達成で長期的な習慣を。
ko: 일일 목표, 연속 체크인, 마일스톤 축하로 장기 습관을 만들어요.
zh_hant: 每日目標、連續打卡、里程碑慶祝,養成長期習慣。

source: 每日额度
en: Daily Quota
ja: 日次クォータ
ko: 일일 한도
zh_hant: 每日額度

source: 每月
en: Monthly
ja: 毎月
ko: 매월

source: 永久删除账户
en: Delete Account Permanently
ja: アカウントを完全に削除
ko: 계정 영구 삭제
zh_hant: 永久刪除帳戶

source: 永久删除账户？
en: Delete Account Permanently?
ja: アカウントを完全に削除しますか?
ko: 계정을 영구 삭제할까요?
zh_hant: 永久刪除帳戶？

source: 汇率
en: Exchange Rate
ja: 為替レート
ko: 환율
zh_hant: 匯率

source: 没有找到包含「%@」的事件
en: No events found matching "%@"
ja: 「%@」を含むイベントが見つかりませんでした
ko: 「%@」을(를) 포함한 이벤트를 찾을 수 없어요
zh_hant: 沒有找到包含「%@」的事件

source: 没有日程安排
en: No events scheduled
ja: 予定なし
ko: 예정된 일정 없음
zh_hant: 沒有日程安排

source: 法律
en: Legal
ja: 法的事項
ko: 법적 고지

source: 注册
en: Sign Up
ja: 新規登録
ko: 가입
zh_hant: 註冊
